SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Bootloader/Device/MM32L0180/Include/reg_rtc.h
/***********************************************************************************************************************
    @file     reg_rtc.h
    @author   VV TEAM
    @brief    This flie contains all the RTC's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_RTC_H
#define __REG_RTC_H

/* Files includes ----------------------------------------------------------------------------------------------------*/
#include <core_cm0plus.h>



/**
  * @brief RTC Base Address Definition
  */
#define  RTC_BASE                                  0x40002800                                       /*!<Base Address: 0x40002800*/

/**
  * @brief RTC Register Structure Definition
  */
typedef struct
{
    __IO uint32_t TR;                             /*!<RTC RTC time register                          offset: 0x00       */
    __IO uint32_t DR;                             /*!<RTC RTC date register                          offset: 0x04       */
    __IO uint32_t CR;                             /*!<RTC RTC control register                       offset: 0x08       */
    __IO uint32_t ISR;                            /*!<RTC RTC initial and status register            offset: 0x0C       */
    __IO uint32_t PRER;                           /*!<RTC RTC division register                      offset: 0x10       */
    __IO uint32_t WUTR;                           /*!<RTC RTC wake up register                       offset: 0x14       */
    __IO uint32_t LSE_CFG;                        /*!<RTC RTC LSE configuration register             offset: 0x18       */
    __IO uint32_t ALARMAR;                        /*!<RTC RTC alarm clock A register                 offset: 0x1C       */
    __IO uint32_t OR;                             /*!<RTC RTC output control register                offset: 0x20       */
    __IO uint32_t SSR;                            /*!<RTC RTC subsecond register                     offset: 0x24       */
    __IO uint32_t TSTR;                           /*!<RTC RTC timestamp time register                offset: 0x28       */
    __IO uint32_t TSDR;                           /*!<RTC RTC timestamp date register                offset: 0x2C       */
    __IO uint32_t TSSR;                           /*!<RTC RTC timestamp subsecond register           offset: 0x30       */
    __IO uint32_t CALR;                           /*!<RTC RTC calibration register                   offset: 0x34       */
    __IO uint32_t SHIFTR;                         /*!<RTC RTC shift control register                 offset: 0x38       */
    __IO uint32_t ALARMASSR;                      /*!<RTC RTC alarm clock A subsecond register       offset: 0x3C       */
    __IO uint32_t TAMPCR;                         /*!<RTC RTC tamper register                        offset: 0x40       */
    __IO uint32_t RESERVED0x44[3];                /*!<                                               offset: 0x44~0x4C  */
    __IO uint32_t BKP0R;                          /*!<RTC BKP backup register                        offset: 0x50       */
    __IO uint32_t BKP1R;                          /*!<RTC BKP backup register                        offset: 0x54       */
    __IO uint32_t BKP2R;                          /*!<RTC BKP backup register                        offset: 0x58       */
    __IO uint32_t BKP3R;                          /*!<RTC BKP backup register                        offset: 0x5C       */
    __IO uint32_t BKP4R;                          /*!<RTC BKP backup register                        offset: 0x60       */
} RTC_TypeDef;

/**
  * @brief RTC type pointer Definition
  */
#define RTC                                       ((RTC_TypeDef *)RTC_BASE)

/**
  * @brief RTC_TR Register Bit Definition
  */
#define  RTC_TR_SU_Pos                            (0)
#define  RTC_TR_SU_Msk                            (0xFU << RTC_TR_SU_Pos)                           /*!<Units of seconds*/
#define  RTC_TR_SU                                RTC_TR_SU_Msk
#define  RTC_TR_SU_0                              (0x1U << RTC_TR_SU_Pos) 
#define  RTC_TR_SU_1                              (0x2U << RTC_TR_SU_Pos) 
#define  RTC_TR_SU_2                              (0x4U << RTC_TR_SU_Pos) 
#define  RTC_TR_SU_3                              (0x8U << RTC_TR_SU_Pos) 
#define  RTC_TR_ST_Pos                            (4)
#define  RTC_TR_ST_Msk                            (0x7U << RTC_TR_ST_Pos)                           /*!<Tens of seconds*/
#define  RTC_TR_ST                                RTC_TR_ST_Msk
#define  RTC_TR_ST_0                              (0x1U << RTC_TR_ST_Pos) 
#define  RTC_TR_ST_1                              (0x2U << RTC_TR_ST_Pos) 
#define  RTC_TR_ST_2                              (0x4U << RTC_TR_ST_Pos) 
#define  RTC_TR_MNU_Pos                           (8)
#define  RTC_TR_MNU_Msk                           (0xFU << RTC_TR_MNU_Pos)                          /*!<Units of minutes*/
#define  RTC_TR_MNU                               RTC_TR_MNU_Msk
#define  RTC_TR_MNU_0                             (0x1U << RTC_TR_MNU_Pos) 
#define  RTC_TR_MNU_1                             (0x2U << RTC_TR_MNU_Pos) 
#define  RTC_TR_MNU_2                             (0x4U << RTC_TR_MNU_Pos) 
#define  RTC_TR_MNU_3                             (0x8U << RTC_TR_MNU_Pos) 
#define  RTC_TR_MNT_Pos                           (12)
#define  RTC_TR_MNT_Msk                           (0x7U << RTC_TR_MNT_Pos)                          /*!<Tens of minutes*/
#define  RTC_TR_MNT                               RTC_TR_MNT_Msk
#define  RTC_TR_MNT_0                             (0x1U << RTC_TR_MNT_Pos) 
#define  RTC_TR_MNT_1                             (0x2U << RTC_TR_MNT_Pos) 
#define  RTC_TR_MNT_2                             (0x4U << RTC_TR_MNT_Pos) 
#define  RTC_TR_HU_Pos                            (16)
#define  RTC_TR_HU_Msk                            (0xFU << RTC_TR_HU_Pos)                           /*!<Units of hours*/
#define  RTC_TR_HU                                RTC_TR_HU_Msk
#define  RTC_TR_HU_0                              (0x1U << RTC_TR_HU_Pos) 
#define  RTC_TR_HU_1                              (0x2U << RTC_TR_HU_Pos) 
#define  RTC_TR_HU_2                              (0x4U << RTC_TR_HU_Pos) 
#define  RTC_TR_HU_3                              (0x8U << RTC_TR_HU_Pos) 
#define  RTC_TR_HT_Pos                            (20)
#define  RTC_TR_HT_Msk                            (0x3U << RTC_TR_HT_Pos)                           /*!<Tens of hours*/
#define  RTC_TR_HT                                RTC_TR_HT_Msk
#define  RTC_TR_HT_0                              (0x1U << RTC_TR_HT_Pos) 
#define  RTC_TR_HT_1                              (0x2U << RTC_TR_HT_Pos) 
#define  RTC_TR_PM_Pos                            (22)
#define  RTC_TR_PM_Msk                            (0x1U << RTC_TR_PM_Pos)                           /*!<0:24 hour format*/
#define  RTC_TR_PM                                RTC_TR_PM_Msk

/**
  * @brief RTC_DR Register Bit Definition
  */
#define  RTC_DR_DU_Pos                            (0)
#define  RTC_DR_DU_Msk                            (0xFU << RTC_DR_DU_Pos)                           /*!<Units of dates*/
#define  RTC_DR_DU                                RTC_DR_DU_Msk
#define  RTC_DR_DU_0                              (0x1U << RTC_DR_DU_Pos) 
#define  RTC_DR_DU_1                              (0x2U << RTC_DR_DU_Pos) 
#define  RTC_DR_DU_2                              (0x4U << RTC_DR_DU_Pos) 
#define  RTC_DR_DU_3                              (0x8U << RTC_DR_DU_Pos) 
#define  RTC_DR_DT_Pos                            (4)
#define  RTC_DR_DT_Msk                            (0x3U << RTC_DR_DT_Pos)                           /*!<Tens of dates*/
#define  RTC_DR_DT                                RTC_DR_DT_Msk
#define  RTC_DR_DT_0                              (0x1U << RTC_DR_DT_Pos) 
#define  RTC_DR_DT_1                              (0x2U << RTC_DR_DT_Pos) 
#define  RTC_DR_MU_Pos                            (8)
#define  RTC_DR_MU_Msk                            (0xFU << RTC_DR_MU_Pos)                           /*!<Units of months*/
#define  RTC_DR_MU                                RTC_DR_MU_Msk
#define  RTC_DR_MU_0                              (0x1U << RTC_DR_MU_Pos) 
#define  RTC_DR_MU_1                              (0x2U << RTC_DR_MU_Pos) 
#define  RTC_DR_MU_2                              (0x4U << RTC_DR_MU_Pos) 
#define  RTC_DR_MU_3                              (0x8U << RTC_DR_MU_Pos) 
#define  RTC_DR_MT_Pos                            (12)
#define  RTC_DR_MT_Msk                            (0x1U << RTC_DR_MT_Pos)                           /*!<Tens of months*/
#define  RTC_DR_MT                                RTC_DR_MT_Msk
#define  RTC_DR_WDU_Pos                           (13)
#define  RTC_DR_WDU_Msk                           (0x7U << RTC_DR_WDU_Pos)                          /*!<Week day unit*/
#define  RTC_DR_WDU                               RTC_DR_WDU_Msk
#define  RTC_DR_WDU_0                             (0x1U << RTC_DR_WDU_Pos) 
#define  RTC_DR_WDU_1                             (0x2U << RTC_DR_WDU_Pos) 
#define  RTC_DR_WDU_2                             (0x4U << RTC_DR_WDU_Pos) 
#define  RTC_DR_YU_Pos                            (16)
#define  RTC_DR_YU_Msk                            (0xFU << RTC_DR_YU_Pos)                           /*!<Units of years*/
#define  RTC_DR_YU                                RTC_DR_YU_Msk
#define  RTC_DR_YU_0                              (0x1U << RTC_DR_YU_Pos) 
#define  RTC_DR_YU_1                              (0x2U << RTC_DR_YU_Pos) 
#define  RTC_DR_YU_2                              (0x4U << RTC_DR_YU_Pos) 
#define  RTC_DR_YU_3                              (0x8U << RTC_DR_YU_Pos) 
#define  RTC_DR_YT_Pos                            (20)
#define  RTC_DR_YT_Msk                            (0xFU << RTC_DR_YT_Pos)                           /*!<Tens of years*/
#define  RTC_DR_YT                                RTC_DR_YT_Msk
#define  RTC_DR_YT_0                              (0x1U << RTC_DR_YT_Pos) 
#define  RTC_DR_YT_1                              (0x2U << RTC_DR_YT_Pos) 
#define  RTC_DR_YT_2                              (0x4U << RTC_DR_YT_Pos) 
#define  RTC_DR_YT_3                              (0x8U << RTC_DR_YT_Pos) 

/**
  * @brief RTC_CR Register Bit Definition
  */
#define  RTC_CR_WUCKSEL_Pos                       (0)
#define  RTC_CR_WUCKSEL_Msk                       (0x7U << RTC_CR_WUCKSEL_Pos)                      /*!<Wake up clock selection*/
#define  RTC_CR_WUCKSEL                           RTC_CR_WUCKSEL_Msk
#define  RTC_CR_WUCKSEL_0                         (0x1U << RTC_CR_WUCKSEL_Pos) 
#define  RTC_CR_WUCKSEL_1                         (0x2U << RTC_CR_WUCKSEL_Pos) 
#define  RTC_CR_WUCKSEL_2                         (0x4U << RTC_CR_WUCKSEL_Pos) 
#define  RTC_CR_TSEDGE_Pos                        (4)
#define  RTC_CR_TSEDGE_Msk                        (0x1U << RTC_CR_TSEDGE_Pos)                       /*!<Active edge of timestamp event*/
#define  RTC_CR_TSEDGE                            RTC_CR_TSEDGE_Msk
#define  RTC_CR_BYPSHAD_Pos                       (5)
#define  RTC_CR_BYPSHAD_Msk                       (0x1U << RTC_CR_BYPSHAD_Pos)                      /*!<Bypass shadow register*/
#define  RTC_CR_BYPSHAD                           RTC_CR_BYPSHAD_Msk
#define  RTC_CR_FMT_Pos                           (6)
#define  RTC_CR_FMT_Msk                           (0x1U << RTC_CR_FMT_Pos)                          /*!<Hour format*/
#define  RTC_CR_FMT                               RTC_CR_FMT_Msk
#define  RTC_CR_ALRAE_Pos                         (7)
#define  RTC_CR_ALRAE_Msk                         (0x1U << RTC_CR_ALRAE_Pos)                        /*!<Alarm clock A enable*/
#define  RTC_CR_ALRAE                             RTC_CR_ALRAE_Msk
#define  RTC_CR_WUTE_Pos                          (10)
#define  RTC_CR_WUTE_Msk                          (0x1U << RTC_CR_WUTE_Pos)                         /*!<Wake up timer enable*/
#define  RTC_CR_WUTE                              RTC_CR_WUTE_Msk
#define  RTC_CR_TSE_Pos                           (11)
#define  RTC_CR_TSE_Msk                           (0x1U << RTC_CR_TSE_Pos)                          /*!<Timestamp enable*/
#define  RTC_CR_TSE                               RTC_CR_TSE_Msk
#define  RTC_CR_TSIE_Pos                          (12)
#define  RTC_CR_TSIE_Msk                          (0x1U << RTC_CR_TSIE_Pos)                         /*!<Timestamp interrupt enable*/
#define  RTC_CR_TSIE                              RTC_CR_TSIE_Msk
#define  RTC_CR_WUTIE_Pos                         (13)
#define  RTC_CR_WUTIE_Msk                         (0x1U << RTC_CR_WUTIE_Pos)                        /*!<Wake up timer interrupt enable*/
#define  RTC_CR_WUTIE                             RTC_CR_WUTIE_Msk
#define  RTC_CR_ALRAIE_Pos                        (14)
#define  RTC_CR_ALRAIE_Msk                        (0x1U << RTC_CR_ALRAIE_Pos)                       /*!<Alarm clock A interrupt enable*/
#define  RTC_CR_ALRAIE                            RTC_CR_ALRAIE_Msk
#define  RTC_CR_ADD1H_Pos                         (16)
#define  RTC_CR_ADD1H_Msk                         (0x1U << RTC_CR_ADD1H_Pos)                        /*!<0: This bit is inactive*/
#define  RTC_CR_ADD1H                             RTC_CR_ADD1H_Msk
#define  RTC_CR_SUB1H_Pos                         (17)
#define  RTC_CR_SUB1H_Msk                         (0x1U << RTC_CR_SUB1H_Pos)                        /*!<0: This bit is inactive*/
#define  RTC_CR_SUB1H                             RTC_CR_SUB1H_Msk
#define  RTC_CR_BKP_Pos                           (18)
#define  RTC_CR_BKP_Msk                           (0x1U << RTC_CR_BKP_Pos)                          /*!<BKP record summer time operation*/
#define  RTC_CR_BKP                               RTC_CR_BKP_Msk
#define  RTC_CR_OSEL_Pos                          (19)
#define  RTC_CR_OSEL_Msk                          (0x3U << RTC_CR_OSEL_Pos)                         /*!<Output flag selection*/
#define  RTC_CR_OSEL                              RTC_CR_OSEL_Msk
#define  RTC_CR_OSEL_0                            (0x1U << RTC_CR_OSEL_Pos) 
#define  RTC_CR_OSEL_1                            (0x2U << RTC_CR_OSEL_Pos) 
#define  RTC_CR_COSEL_Pos                         (21)
#define  RTC_CR_COSEL_Msk                         (0x1U << RTC_CR_COSEL_Pos)                        /*!<COSEL: Calibration output selection*/
#define  RTC_CR_COSEL                             RTC_CR_COSEL_Msk
#define  RTC_CR_COE_Pos                           (22)
#define  RTC_CR_COE_Msk                           (0x1U << RTC_CR_COE_Pos)                          /*!<COE: Calibration output enable*/
#define  RTC_CR_COE                               RTC_CR_COE_Msk
#define  RTC_CR_POL_Pos                           (23)
#define  RTC_CR_POL_Msk                           (0x1U << RTC_CR_POL_Pos)                          /*!<POL: Output polarity*/
#define  RTC_CR_POL                               RTC_CR_POL_Msk

/**
  * @brief RTC_ISR Register Bit Definition
  */
#define  RTC_ISR_ALRAWF_Pos                       (0)
#define  RTC_ISR_ALRAWF_Msk                       (0x1U << RTC_ISR_ALRAWF_Pos)                      /*!<Alarm clock A write flag*/
#define  RTC_ISR_ALRAWF                           RTC_ISR_ALRAWF_Msk
#define  RTC_ISR_WUTWF_Pos                        (2)
#define  RTC_ISR_WUTWF_Msk                        (0x1U << RTC_ISR_WUTWF_Pos)                       /*!<Wake up timer write flag*/
#define  RTC_ISR_WUTWF                            RTC_ISR_WUTWF_Msk
#define  RTC_ISR_SHPF_Pos                         (3)
#define  RTC_ISR_SHPF_Msk                         (0x1U << RTC_ISR_SHPF_Pos)                        /*!<Shift operation flag*/
#define  RTC_ISR_SHPF                             RTC_ISR_SHPF_Msk
#define  RTC_ISR_INITS_Pos                        (4)
#define  RTC_ISR_INITS_Msk                        (0x1U << RTC_ISR_INITS_Pos)                       /*!<Initializing status flag*/
#define  RTC_ISR_INITS                            RTC_ISR_INITS_Msk
#define  RTC_ISR_RSF_Pos                          (5)
#define  RTC_ISR_RSF_Msk                          (0x1U << RTC_ISR_RSF_Pos)                         /*!<Register synchronization flag*/
#define  RTC_ISR_RSF                              RTC_ISR_RSF_Msk
#define  RTC_ISR_INITF_Pos                        (6)
#define  RTC_ISR_INITF_Msk                        (0x1U << RTC_ISR_INITF_Pos)                       /*!<Initial flag*/
#define  RTC_ISR_INITF                            RTC_ISR_INITF_Msk
#define  RTC_ISR_INIT_Pos                         (7)
#define  RTC_ISR_INIT_Msk                         (0x1U << RTC_ISR_INIT_Pos)                        /*!<Initializing mode*/
#define  RTC_ISR_INIT                             RTC_ISR_INIT_Msk
#define  RTC_ISR_ALRAF_Pos                        (8)
#define  RTC_ISR_ALRAF_Msk                        (0x1U << RTC_ISR_ALRAF_Pos)                       /*!<Alarm clock occurrence flag*/
#define  RTC_ISR_ALRAF                            RTC_ISR_ALRAF_Msk
#define  RTC_ISR_WUTF_Pos                         (10)
#define  RTC_ISR_WUTF_Msk                         (0x1U << RTC_ISR_WUTF_Pos)                        /*!<Wake up unit flag*/
#define  RTC_ISR_WUTF                             RTC_ISR_WUTF_Msk
#define  RTC_ISR_TSF_Pos                          (11)
#define  RTC_ISR_TSF_Msk                          (0x1U << RTC_ISR_TSF_Pos)                         /*!<Timestamp event flag*/
#define  RTC_ISR_TSF                              RTC_ISR_TSF_Msk
#define  RTC_ISR_TSOVF_Pos                        (12)
#define  RTC_ISR_TSOVF_Msk                        (0x1U << RTC_ISR_TSOVF_Pos)                       /*!<Timestamp overflow flag*/
#define  RTC_ISR_TSOVF                            RTC_ISR_TSOVF_Msk

/**
  * @brief RTC_PRER Register Bit Definition
  */
#define  RTC_PRER_PREDIV_S_Pos                    (0)
#define  RTC_PRER_PREDIV_S_Msk                    (0x7FFFU << RTC_PRER_PREDIV_S_Pos)                /*!<Synchronous prescaler coefficient*/
#define  RTC_PRER_PREDIV_S                        RTC_PRER_PREDIV_S_Msk
#define  RTC_PRER_PREDIV_S_0                      (0x0001U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_1                      (0x0002U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_2                      (0x0004U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_3                      (0x0008U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_4                      (0x0010U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_5                      (0x0020U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_6                      (0x0040U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_7                      (0x0080U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_8                      (0x0100U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_9                      (0x0200U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_10                     (0x0400U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_11                     (0x0800U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_12                     (0x1000U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_13                     (0x2000U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_S_14                     (0x4000U << RTC_PRER_PREDIV_S_Pos) 
#define  RTC_PRER_PREDIV_A_Pos                    (16)
#define  RTC_PRER_PREDIV_A_Msk                    (0x7FU << RTC_PRER_PREDIV_A_Pos)                  /*!<Asynchronous prescaler coefficient*/
#define  RTC_PRER_PREDIV_A                        RTC_PRER_PREDIV_A_Msk
#define  RTC_PRER_PREDIV_A_0                      (0x01U << RTC_PRER_PREDIV_A_Pos) 
#define  RTC_PRER_PREDIV_A_1                      (0x02U << RTC_PRER_PREDIV_A_Pos) 
#define  RTC_PRER_PREDIV_A_2                      (0x04U << RTC_PRER_PREDIV_A_Pos) 
#define  RTC_PRER_PREDIV_A_3                      (0x08U << RTC_PRER_PREDIV_A_Pos) 
#define  RTC_PRER_PREDIV_A_4                      (0x10U << RTC_PRER_PREDIV_A_Pos) 
#define  RTC_PRER_PREDIV_A_5                      (0x20U << RTC_PRER_PREDIV_A_Pos) 
#define  RTC_PRER_PREDIV_A_6                      (0x40U << RTC_PRER_PREDIV_A_Pos) 

