SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Bootloader/Device/MM32L0180/Include/reg_rtc.h
/**
  * @brief RTC_WUTR Register Bit Definition
  */
#define  RTC_WUTR_WUTRL_Pos                       (0)
#define  RTC_WUTR_WUTRL_Msk                       (0xFFFFU << RTC_WUTR_WUTRL_Pos)                   /*!<Wake up auto reload value bit*/
#define  RTC_WUTR_WUTRL                           RTC_WUTR_WUTRL_Msk
#define  RTC_WUTR_WUTRL_0                         (0x0001U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_1                         (0x0002U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_2                         (0x0004U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_3                         (0x0008U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_4                         (0x0010U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_5                         (0x0020U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_6                         (0x0040U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_7                         (0x0080U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_8                         (0x0100U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_9                         (0x0200U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_10                        (0x0400U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_11                        (0x0800U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_12                        (0x1000U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_13                        (0x2000U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_14                        (0x4000U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRL_15                        (0x8000U << RTC_WUTR_WUTRL_Pos) 
#define  RTC_WUTR_WUTRH_Pos                       (16)
#define  RTC_WUTR_WUTRH_Msk                       (0x1U << RTC_WUTR_WUTRH_Pos)                      /*!<Configure WUCKSEL[2] =1. This bit is always set. It's cleared under other*/
#define  RTC_WUTR_WUTRH                           RTC_WUTR_WUTRH_Msk

/**
  * @brief RTC_LSE_CFG Register Bit Definition
  */
#define  RTC_LSE_CFG_LSE_TC_Pos                   (0)
#define  RTC_LSE_CFG_LSE_TC_Msk                   (0x3U << RTC_LSE_CFG_LSE_TC_Pos)                  /*!<LSE high temperature leakage compensation mode*/
#define  RTC_LSE_CFG_LSE_TC                       RTC_LSE_CFG_LSE_TC_Msk
#define  RTC_LSE_CFG_LSE_TC_0                     (0x1U << RTC_LSE_CFG_LSE_TC_Pos) 
#define  RTC_LSE_CFG_LSE_TC_1                     (0x2U << RTC_LSE_CFG_LSE_TC_Pos) 
#define  RTC_LSE_CFG_LSE_OUTENH_Pos               (2)
#define  RTC_LSE_CFG_LSE_OUTENH_Msk               (0x1U << RTC_LSE_CFG_LSE_OUTENH_Pos)              /*!<0: Normal mode*/
#define  RTC_LSE_CFG_LSE_OUTENH                   RTC_LSE_CFG_LSE_OUTENH_Msk
#define  RTC_LSE_CFG_LSE_DR_Pos                   (4)
#define  RTC_LSE_CFG_LSE_DR_Msk                   (0x3U << RTC_LSE_CFG_LSE_DR_Pos)                  /*!<LSE_DR: LSE drive capacity selection*/
#define  RTC_LSE_CFG_LSE_DR                       RTC_LSE_CFG_LSE_DR_Msk
#define  RTC_LSE_CFG_LSE_DR_0                     (0x1U << RTC_LSE_CFG_LSE_DR_Pos) 
#define  RTC_LSE_CFG_LSE_DR_1                     (0x2U << RTC_LSE_CFG_LSE_DR_Pos) 
#define  RTC_LSE_CFG_LSE_RFB_SEL_Pos              (6)
#define  RTC_LSE_CFG_LSE_RFB_SEL_Msk              (0x3U << RTC_LSE_CFG_LSE_RFB_SEL_Pos)             /*!<LSE_RFB_SEL: LSE feedback resistance selection*/
#define  RTC_LSE_CFG_LSE_RFB_SEL                  RTC_LSE_CFG_LSE_RFB_SEL_Msk
#define  RTC_LSE_CFG_LSE_RFB_SEL_0                (0x1U << RTC_LSE_CFG_LSE_RFB_SEL_Pos) 
#define  RTC_LSE_CFG_LSE_RFB_SEL_1                (0x2U << RTC_LSE_CFG_LSE_RFB_SEL_Pos) 
#define  RTC_LSE_CFG_LSE_IB_Pos                   (8)
#define  RTC_LSE_CFG_LSE_IB_Msk                   (0x3U << RTC_LSE_CFG_LSE_IB_Pos)                  /*!<LSE_IB: LSE bias current regulation*/
#define  RTC_LSE_CFG_LSE_IB                       RTC_LSE_CFG_LSE_IB_Msk
#define  RTC_LSE_CFG_LSE_IB_0                     (0x1U << RTC_LSE_CFG_LSE_IB_Pos) 
#define  RTC_LSE_CFG_LSE_IB_1                     (0x2U << RTC_LSE_CFG_LSE_IB_Pos) 
#define  RTC_LSE_CFG_LSE_AAC_Pos                  (10)
#define  RTC_LSE_CFG_LSE_AAC_Msk                  (0x1U << RTC_LSE_CFG_LSE_AAC_Pos)                 /*!<Auto gain regulation*/
#define  RTC_LSE_CFG_LSE_AAC                      RTC_LSE_CFG_LSE_AAC_Msk

/**
  * @brief RTC_ALARMAR Register Bit Definition
  */
#define  RTC_ALARMAR_SU_Pos                       (0)
#define  RTC_ALARMAR_SU_Msk                       (0xFU << RTC_ALARMAR_SU_Pos)                      /*!<Units of seconds*/
#define  RTC_ALARMAR_SU                           RTC_ALARMAR_SU_Msk
#define  RTC_ALARMAR_SU_0                         (0x1U << RTC_ALARMAR_SU_Pos) 
#define  RTC_ALARMAR_SU_1                         (0x2U << RTC_ALARMAR_SU_Pos) 
#define  RTC_ALARMAR_SU_2                         (0x4U << RTC_ALARMAR_SU_Pos) 
#define  RTC_ALARMAR_SU_3                         (0x8U << RTC_ALARMAR_SU_Pos) 
#define  RTC_ALARMAR_ST_Pos                       (4)
#define  RTC_ALARMAR_ST_Msk                       (0x7U << RTC_ALARMAR_ST_Pos)                      /*!<Tens of seconds*/
#define  RTC_ALARMAR_ST                           RTC_ALARMAR_ST_Msk
#define  RTC_ALARMAR_ST_0                         (0x1U << RTC_ALARMAR_ST_Pos) 
#define  RTC_ALARMAR_ST_1                         (0x2U << RTC_ALARMAR_ST_Pos) 
#define  RTC_ALARMAR_ST_2                         (0x4U << RTC_ALARMAR_ST_Pos) 
#define  RTC_ALARMAR_MSK1_Pos                     (7)
#define  RTC_ALARMAR_MSK1_Msk                     (0x1U << RTC_ALARMAR_MSK1_Pos)                    /*!<Alarm clock second mask bit*/
#define  RTC_ALARMAR_MSK1                         RTC_ALARMAR_MSK1_Msk
#define  RTC_ALARMAR_MNU_Pos                      (8)
#define  RTC_ALARMAR_MNU_Msk                      (0xFU << RTC_ALARMAR_MNU_Pos)                     /*!<Units of minutes*/
#define  RTC_ALARMAR_MNU                          RTC_ALARMAR_MNU_Msk
#define  RTC_ALARMAR_MNU_0                        (0x1U << RTC_ALARMAR_MNU_Pos) 
#define  RTC_ALARMAR_MNU_1                        (0x2U << RTC_ALARMAR_MNU_Pos) 
#define  RTC_ALARMAR_MNU_2                        (0x4U << RTC_ALARMAR_MNU_Pos) 
#define  RTC_ALARMAR_MNU_3                        (0x8U << RTC_ALARMAR_MNU_Pos) 
#define  RTC_ALARMAR_MNT_Pos                      (12)
#define  RTC_ALARMAR_MNT_Msk                      (0x7U << RTC_ALARMAR_MNT_Pos)                     /*!<Tens of minutes*/
#define  RTC_ALARMAR_MNT                          RTC_ALARMAR_MNT_Msk
#define  RTC_ALARMAR_MNT_0                        (0x1U << RTC_ALARMAR_MNT_Pos) 
#define  RTC_ALARMAR_MNT_1                        (0x2U << RTC_ALARMAR_MNT_Pos) 
#define  RTC_ALARMAR_MNT_2                        (0x4U << RTC_ALARMAR_MNT_Pos) 
#define  RTC_ALARMAR_MSK2_Pos                     (15)
#define  RTC_ALARMAR_MSK2_Msk                     (0x1U << RTC_ALARMAR_MSK2_Pos)                    /*!<Alarm clock minute mask bit*/
#define  RTC_ALARMAR_MSK2                         RTC_ALARMAR_MSK2_Msk
#define  RTC_ALARMAR_HU_Pos                       (16)
#define  RTC_ALARMAR_HU_Msk                       (0xFU << RTC_ALARMAR_HU_Pos)                      /*!<Units of hours*/
#define  RTC_ALARMAR_HU                           RTC_ALARMAR_HU_Msk
#define  RTC_ALARMAR_HU_0                         (0x1U << RTC_ALARMAR_HU_Pos) 
#define  RTC_ALARMAR_HU_1                         (0x2U << RTC_ALARMAR_HU_Pos) 
#define  RTC_ALARMAR_HU_2                         (0x4U << RTC_ALARMAR_HU_Pos) 
#define  RTC_ALARMAR_HU_3                         (0x8U << RTC_ALARMAR_HU_Pos) 
#define  RTC_ALARMAR_HT_Pos                       (20)
#define  RTC_ALARMAR_HT_Msk                       (0x3U << RTC_ALARMAR_HT_Pos)                      /*!<Tens of hours*/
#define  RTC_ALARMAR_HT                           RTC_ALARMAR_HT_Msk
#define  RTC_ALARMAR_HT_0                         (0x1U << RTC_ALARMAR_HT_Pos) 
#define  RTC_ALARMAR_HT_1                         (0x2U << RTC_ALARMAR_HT_Pos) 
#define  RTC_ALARMAR_PM_Pos                       (22)
#define  RTC_ALARMAR_PM_Msk                       (0x1U << RTC_ALARMAR_PM_Pos)                      /*!<0: 24 hour format*/
#define  RTC_ALARMAR_PM                           RTC_ALARMAR_PM_Msk
#define  RTC_ALARMAR_MSK3_Pos                     (23)
#define  RTC_ALARMAR_MSK3_Msk                     (0x1U << RTC_ALARMAR_MSK3_Pos)                    /*!<Alarm clock hour mask bit*/
#define  RTC_ALARMAR_MSK3                         RTC_ALARMAR_MSK3_Msk
#define  RTC_ALARMAR_DU_Pos                       (24)
#define  RTC_ALARMAR_DU_Msk                       (0xFU << RTC_ALARMAR_DU_Pos)                      /*!<Units of date*/
#define  RTC_ALARMAR_DU                           RTC_ALARMAR_DU_Msk
#define  RTC_ALARMAR_DU_0                         (0x1U << RTC_ALARMAR_DU_Pos) 
#define  RTC_ALARMAR_DU_1                         (0x2U << RTC_ALARMAR_DU_Pos) 
#define  RTC_ALARMAR_DU_2                         (0x4U << RTC_ALARMAR_DU_Pos) 
#define  RTC_ALARMAR_DU_3                         (0x8U << RTC_ALARMAR_DU_Pos) 
#define  RTC_ALARMAR_DT_Pos                       (28)
#define  RTC_ALARMAR_DT_Msk                       (0x3U << RTC_ALARMAR_DT_Pos)                      /*!<Tens of date*/
#define  RTC_ALARMAR_DT                           RTC_ALARMAR_DT_Msk
#define  RTC_ALARMAR_DT_0                         (0x1U << RTC_ALARMAR_DT_Pos) 
#define  RTC_ALARMAR_DT_1                         (0x2U << RTC_ALARMAR_DT_Pos) 
#define  RTC_ALARMAR_WDSEL_Pos                    (30)
#define  RTC_ALARMAR_WDSEL_Msk                    (0x1U << RTC_ALARMAR_WDSEL_Pos)                   /*!<Alarm clock date or week day selection bit*/
#define  RTC_ALARMAR_WDSEL                        RTC_ALARMAR_WDSEL_Msk
#define  RTC_ALARMAR_MSK4_Pos                     (31)
#define  RTC_ALARMAR_MSK4_Msk                     (0x1U << RTC_ALARMAR_MSK4_Pos)                    /*!<Alarm clock date or week day mask bit*/
#define  RTC_ALARMAR_MSK4                         RTC_ALARMAR_MSK4_Msk

/**
  * @brief RTC_OR Register Bit Definition
  */
#define  RTC_OR_REMAP_Pos                         (0)
#define  RTC_OR_REMAP_Msk                         (0x1U << RTC_OR_REMAP_Pos)                        /*!<remap=0*/
#define  RTC_OR_REMAP                             RTC_OR_REMAP_Msk

/**
  * @brief RTC_SSR Register Bit Definition
  */
#define  RTC_SSR_SS_Pos                           (0)
#define  RTC_SSR_SS_Msk                           (0x7FFFU << RTC_SSR_SS_Pos)                       /*!<SS is the value of synchronous prescaler counter. Subsecond calculation formula*/
#define  RTC_SSR_SS                               RTC_SSR_SS_Msk
#define  RTC_SSR_SS_0                             (0x0001U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_1                             (0x0002U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_2                             (0x0004U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_3                             (0x0008U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_4                             (0x0010U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_5                             (0x0020U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_6                             (0x0040U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_7                             (0x0080U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_8                             (0x0100U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_9                             (0x0200U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_10                            (0x0400U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_11                            (0x0800U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_12                            (0x1000U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_13                            (0x2000U << RTC_SSR_SS_Pos) 
#define  RTC_SSR_SS_14                            (0x4000U << RTC_SSR_SS_Pos) 

/**
  * @brief RTC_TSTR Register Bit Definition
  */
#define  RTC_TSTR_SU_Pos                          (0)
#define  RTC_TSTR_SU_Msk                          (0xFU << RTC_TSTR_SU_Pos)                         /*!<Units of seconds*/
#define  RTC_TSTR_SU                              RTC_TSTR_SU_Msk
#define  RTC_TSTR_SU_0                            (0x1U << RTC_TSTR_SU_Pos) 
#define  RTC_TSTR_SU_1                            (0x2U << RTC_TSTR_SU_Pos) 
#define  RTC_TSTR_SU_2                            (0x4U << RTC_TSTR_SU_Pos) 
#define  RTC_TSTR_SU_3                            (0x8U << RTC_TSTR_SU_Pos) 
#define  RTC_TSTR_ST_Pos                          (4)
#define  RTC_TSTR_ST_Msk                          (0x7U << RTC_TSTR_ST_Pos)                         /*!<Tens of seconds*/
#define  RTC_TSTR_ST                              RTC_TSTR_ST_Msk
#define  RTC_TSTR_ST_0                            (0x1U << RTC_TSTR_ST_Pos) 
#define  RTC_TSTR_ST_1                            (0x2U << RTC_TSTR_ST_Pos) 
#define  RTC_TSTR_ST_2                            (0x4U << RTC_TSTR_ST_Pos) 
#define  RTC_TSTR_MNU_Pos                         (8)
#define  RTC_TSTR_MNU_Msk                         (0xFU << RTC_TSTR_MNU_Pos)                        /*!<Units of minutes*/
#define  RTC_TSTR_MNU                             RTC_TSTR_MNU_Msk
#define  RTC_TSTR_MNU_0                           (0x1U << RTC_TSTR_MNU_Pos) 
#define  RTC_TSTR_MNU_1                           (0x2U << RTC_TSTR_MNU_Pos) 
#define  RTC_TSTR_MNU_2                           (0x4U << RTC_TSTR_MNU_Pos) 
#define  RTC_TSTR_MNU_3                           (0x8U << RTC_TSTR_MNU_Pos) 
#define  RTC_TSTR_MNT_Pos                         (12)
#define  RTC_TSTR_MNT_Msk                         (0x7U << RTC_TSTR_MNT_Pos)                        /*!<Tens of minutes*/
#define  RTC_TSTR_MNT                             RTC_TSTR_MNT_Msk
#define  RTC_TSTR_MNT_0                           (0x1U << RTC_TSTR_MNT_Pos) 
#define  RTC_TSTR_MNT_1                           (0x2U << RTC_TSTR_MNT_Pos) 
#define  RTC_TSTR_MNT_2                           (0x4U << RTC_TSTR_MNT_Pos) 
#define  RTC_TSTR_HU_Pos                          (16)
#define  RTC_TSTR_HU_Msk                          (0xFU << RTC_TSTR_HU_Pos)                         /*!<Units of hours*/
#define  RTC_TSTR_HU                              RTC_TSTR_HU_Msk
#define  RTC_TSTR_HU_0                            (0x1U << RTC_TSTR_HU_Pos) 
#define  RTC_TSTR_HU_1                            (0x2U << RTC_TSTR_HU_Pos) 
#define  RTC_TSTR_HU_2                            (0x4U << RTC_TSTR_HU_Pos) 
#define  RTC_TSTR_HU_3                            (0x8U << RTC_TSTR_HU_Pos) 
#define  RTC_TSTR_HT_Pos                          (20)
#define  RTC_TSTR_HT_Msk                          (0x3U << RTC_TSTR_HT_Pos)                         /*!<Tens of hours*/
#define  RTC_TSTR_HT                              RTC_TSTR_HT_Msk
#define  RTC_TSTR_HT_0                            (0x1U << RTC_TSTR_HT_Pos) 
#define  RTC_TSTR_HT_1                            (0x2U << RTC_TSTR_HT_Pos) 
#define  RTC_TSTR_PM_Pos                          (22)
#define  RTC_TSTR_PM_Msk                          (0x1U << RTC_TSTR_PM_Pos)                         /*!<0: 24 hour format*/
#define  RTC_TSTR_PM                              RTC_TSTR_PM_Msk

/**
  * @brief RTC_TSDR Register Bit Definition
  */
#define  RTC_TSDR_DU_Pos                          (0)
#define  RTC_TSDR_DU_Msk                          (0xFU << RTC_TSDR_DU_Pos)                         /*!<Units of date*/
#define  RTC_TSDR_DU                              RTC_TSDR_DU_Msk
#define  RTC_TSDR_DU_0                            (0x1U << RTC_TSDR_DU_Pos) 
#define  RTC_TSDR_DU_1                            (0x2U << RTC_TSDR_DU_Pos) 
#define  RTC_TSDR_DU_2                            (0x4U << RTC_TSDR_DU_Pos) 
#define  RTC_TSDR_DU_3                            (0x8U << RTC_TSDR_DU_Pos) 
#define  RTC_TSDR_DT_Pos                          (4)
#define  RTC_TSDR_DT_Msk                          (0x3U << RTC_TSDR_DT_Pos)                         /*!<Tens of date*/
#define  RTC_TSDR_DT                              RTC_TSDR_DT_Msk
#define  RTC_TSDR_DT_0                            (0x1U << RTC_TSDR_DT_Pos) 
#define  RTC_TSDR_DT_1                            (0x2U << RTC_TSDR_DT_Pos) 
#define  RTC_TSDR_MU_Pos                          (8)
#define  RTC_TSDR_MU_Msk                          (0xFU << RTC_TSDR_MU_Pos)                         /*!<Units of months*/
#define  RTC_TSDR_MU                              RTC_TSDR_MU_Msk
#define  RTC_TSDR_MU_0                            (0x1U << RTC_TSDR_MU_Pos) 
#define  RTC_TSDR_MU_1                            (0x2U << RTC_TSDR_MU_Pos) 
#define  RTC_TSDR_MU_2                            (0x4U << RTC_TSDR_MU_Pos) 
#define  RTC_TSDR_MU_3                            (0x8U << RTC_TSDR_MU_Pos) 
#define  RTC_TSDR_MT_Pos                          (12)
#define  RTC_TSDR_MT_Msk                          (0x1U << RTC_TSDR_MT_Pos)                         /*!<Tens of months*/
#define  RTC_TSDR_MT                              RTC_TSDR_MT_Msk
#define  RTC_TSDR_WDU_Pos                         (13)
#define  RTC_TSDR_WDU_Msk                         (0x7U << RTC_TSDR_WDU_Pos)                        /*!<Week day unit*/
#define  RTC_TSDR_WDU                             RTC_TSDR_WDU_Msk
#define  RTC_TSDR_WDU_0                           (0x1U << RTC_TSDR_WDU_Pos) 
#define  RTC_TSDR_WDU_1                           (0x2U << RTC_TSDR_WDU_Pos) 
#define  RTC_TSDR_WDU_2                           (0x4U << RTC_TSDR_WDU_Pos) 
#define  RTC_TSDR_YU_Pos                          (16)
#define  RTC_TSDR_YU_Msk                          (0xFU << RTC_TSDR_YU_Pos)                         /*!<Units of years*/
#define  RTC_TSDR_YU                              RTC_TSDR_YU_Msk
#define  RTC_TSDR_YU_0                            (0x1U << RTC_TSDR_YU_Pos) 
#define  RTC_TSDR_YU_1                            (0x2U << RTC_TSDR_YU_Pos) 
#define  RTC_TSDR_YU_2                            (0x4U << RTC_TSDR_YU_Pos) 
#define  RTC_TSDR_YU_3                            (0x8U << RTC_TSDR_YU_Pos) 
#define  RTC_TSDR_YT_Pos                          (20)
#define  RTC_TSDR_YT_Msk                          (0xFU << RTC_TSDR_YT_Pos)                         /*!<Tens of years*/
#define  RTC_TSDR_YT                              RTC_TSDR_YT_Msk
#define  RTC_TSDR_YT_0                            (0x1U << RTC_TSDR_YT_Pos) 
#define  RTC_TSDR_YT_1                            (0x2U << RTC_TSDR_YT_Pos) 
#define  RTC_TSDR_YT_2                            (0x4U << RTC_TSDR_YT_Pos) 
#define  RTC_TSDR_YT_3                            (0x8U << RTC_TSDR_YT_Pos) 

/**
  * @brief RTC_TSSR Register Bit Definition
  */
#define  RTC_TSSR_SS_Pos                          (0)
#define  RTC_TSSR_SS_Msk                          (0x7FFFU << RTC_TSSR_SS_Pos)                      /*!<Subsecond value*/
#define  RTC_TSSR_SS                              RTC_TSSR_SS_Msk
#define  RTC_TSSR_SS_0                            (0x0001U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_1                            (0x0002U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_2                            (0x0004U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_3                            (0x0008U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_4                            (0x0010U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_5                            (0x0020U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_6                            (0x0040U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_7                            (0x0080U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_8                            (0x0100U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_9                            (0x0200U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_10                           (0x0400U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_11                           (0x0800U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_12                           (0x1000U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_13                           (0x2000U << RTC_TSSR_SS_Pos) 
#define  RTC_TSSR_SS_14                           (0x4000U << RTC_TSSR_SS_Pos) 

/**
  * @brief RTC_CALR Register Bit Definition
  */
#define  RTC_CALR_CALM_Pos                        (0)
#define  RTC_CALR_CALM_Msk                        (0x1FFU << RTC_CALR_CALM_Pos)                     /*!<The number of pulse masked within 2 to the 20th power RTC clock pulse*/
#define  RTC_CALR_CALM                            RTC_CALR_CALM_Msk
#define  RTC_CALR_CALM_0                          (0x001U << RTC_CALR_CALM_Pos) 
#define  RTC_CALR_CALM_1                          (0x002U << RTC_CALR_CALM_Pos) 
#define  RTC_CALR_CALM_2                          (0x004U << RTC_CALR_CALM_Pos) 
#define  RTC_CALR_CALM_3                          (0x008U << RTC_CALR_CALM_Pos) 
#define  RTC_CALR_CALM_4                          (0x010U << RTC_CALR_CALM_Pos) 
#define  RTC_CALR_CALM_5                          (0x020U << RTC_CALR_CALM_Pos) 
#define  RTC_CALR_CALM_6                          (0x040U << RTC_CALR_CALM_Pos) 
#define  RTC_CALR_CALM_7                          (0x080U << RTC_CALR_CALM_Pos) 
#define  RTC_CALR_CALM_8                          (0x100U << RTC_CALR_CALM_Pos) 
#define  RTC_CALR_CALP_Pos                        (15)
#define  RTC_CALR_CALP_Msk                        (0x1U << RTC_CALR_CALP_Pos)                       /*!<Frequency increase 488.5 ppm*/
#define  RTC_CALR_CALP                            RTC_CALR_CALP_Msk

/**
  * @brief RTC_SHIFTR Register Bit Definition
  */
#define  RTC_SHIFTR_SUBFS_Pos                     (0)
#define  RTC_SHIFTR_SUBFS_Msk                     (0x7FFFU << RTC_SHIFTR_SUBFS_Pos)                 /*!<Reduce subsecond value*/
#define  RTC_SHIFTR_SUBFS                         RTC_SHIFTR_SUBFS_Msk
#define  RTC_SHIFTR_SUBFS_0                       (0x0001U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_1                       (0x0002U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_2                       (0x0004U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_3                       (0x0008U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_4                       (0x0010U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_5                       (0x0020U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_6                       (0x0040U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_7                       (0x0080U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_8                       (0x0100U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_9                       (0x0200U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_10                      (0x0400U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_11                      (0x0800U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_12                      (0x1000U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_13                      (0x2000U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_SUBFS_14                      (0x4000U << RTC_SHIFTR_SUBFS_Pos) 
#define  RTC_SHIFTR_ADD1S_Pos                     (16)
#define  RTC_SHIFTR_ADD1S_Msk                     (0x1U << RTC_SHIFTR_ADD1S_Pos)                    /*!<Increase 1s*/
#define  RTC_SHIFTR_ADD1S                         RTC_SHIFTR_ADD1S_Msk

