SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Bootloader/Device/MM32L0180/Include/reg_rtc.h
/**
  * @brief RTC_ALARMASSR Register Bit Definition
  */
#define  RTC_ALARMASSR_SS_Pos                     (0)
#define  RTC_ALARMASSR_SS_Msk                     (0x7FFFU << RTC_ALARMASSR_SS_Pos)                 /*!<Alarm clock subsecond value, used for comparing with the synchronous prescaler counter*/
#define  RTC_ALARMASSR_SS                         RTC_ALARMASSR_SS_Msk
#define  RTC_ALARMASSR_SS_0                       (0x0001U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_1                       (0x0002U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_2                       (0x0004U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_3                       (0x0008U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_4                       (0x0010U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_5                       (0x0020U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_6                       (0x0040U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_7                       (0x0080U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_8                       (0x0100U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_9                       (0x0200U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_10                      (0x0400U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_11                      (0x0800U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_12                      (0x1000U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_13                      (0x2000U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_SS_14                      (0x4000U << RTC_ALARMASSR_SS_Pos) 
#define  RTC_ALARMASSR_MASKSS_Pos                 (16)
#define  RTC_ALARMASSR_MASKSS_Msk                 (0xFU << RTC_ALARMASSR_MASKSS_Pos)                /*!<Max. valid bit when the mask starts from this bit.*/
#define  RTC_ALARMASSR_MASKSS                     RTC_ALARMASSR_MASKSS_Msk
#define  RTC_ALARMASSR_MASKSS_0                   (0x1U << RTC_ALARMASSR_MASKSS_Pos) 
#define  RTC_ALARMASSR_MASKSS_1                   (0x2U << RTC_ALARMASSR_MASKSS_Pos) 
#define  RTC_ALARMASSR_MASKSS_2                   (0x4U << RTC_ALARMASSR_MASKSS_Pos) 
#define  RTC_ALARMASSR_MASKSS_3                   (0x8U << RTC_ALARMASSR_MASKSS_Pos) 

/**
  * @brief RTC_TAMPCR Register Bit Definition
  */
#define  RTC_TAMPCR_TAMP1E_Pos                    (0)
#define  RTC_TAMPCR_TAMP1E_Msk                    (0x1U << RTC_TAMPCR_TAMP1E_Pos)                   /*!<TAMP1 tamper enable*/
#define  RTC_TAMPCR_TAMP1E                        RTC_TAMPCR_TAMP1E_Msk
#define  RTC_TAMPCR_TAMP1IE_Pos                   (1)
#define  RTC_TAMPCR_TAMP1IE_Msk                   (0x1U << RTC_TAMPCR_TAMP1IE_Pos)                  /*!<TAMP1 tamper interrupt enable*/
#define  RTC_TAMPCR_TAMP1IE                       RTC_TAMPCR_TAMP1IE_Msk
#define  RTC_TAMPCR_TAMP1TRG_Pos                  (2)
#define  RTC_TAMPCR_TAMP1TRG_Msk                  (0x1U << RTC_TAMPCR_TAMP1TRG_Pos)                 /*!<TAMP1 tamper valid edge selection*/
#define  RTC_TAMPCR_TAMP1TRG                      RTC_TAMPCR_TAMP1TRG_Msk
#define  RTC_TAMPCR_TAMP1F_Pos                    (3)
#define  RTC_TAMPCR_TAMP1F_Msk                    (0x1U << RTC_TAMPCR_TAMP1F_Pos)                   /*!<TAMP1 tamper flag*/
#define  RTC_TAMPCR_TAMP1F                        RTC_TAMPCR_TAMP1F_Msk
#define  RTC_TAMPCR_TAMPTS_Pos                    (4)
#define  RTC_TAMPCR_TAMPTS_Msk                    (0x1U << RTC_TAMPCR_TAMPTS_Pos)                   /*!<Activate timestamp in case of tamper detection event*/
#define  RTC_TAMPCR_TAMPTS                        RTC_TAMPCR_TAMPTS_Msk
#define  RTC_TAMPCR_TAMP2E_Pos                    (5)
#define  RTC_TAMPCR_TAMP2E_Msk                    (0x1U << RTC_TAMPCR_TAMP2E_Pos)                   /*!<TAMP2 tamper enable*/
#define  RTC_TAMPCR_TAMP2E                        RTC_TAMPCR_TAMP2E_Msk
#define  RTC_TAMPCR_TAMP2IE_Pos                   (6)
#define  RTC_TAMPCR_TAMP2IE_Msk                   (0x1U << RTC_TAMPCR_TAMP2IE_Pos)                  /*!<TAMP2 tamper interrupt enable*/
#define  RTC_TAMPCR_TAMP2IE                       RTC_TAMPCR_TAMP2IE_Msk
#define  RTC_TAMPCR_TAMP2TRG_Pos                  (7)
#define  RTC_TAMPCR_TAMP2TRG_Msk                  (0x1U << RTC_TAMPCR_TAMP2TRG_Pos)                 /*!<TAMP2 tamper valid edge selection*/
#define  RTC_TAMPCR_TAMP2TRG                      RTC_TAMPCR_TAMP2TRG_Msk
#define  RTC_TAMPCR_TAMP2F_Pos                    (8)
#define  RTC_TAMPCR_TAMP2F_Msk                    (0x1U << RTC_TAMPCR_TAMP2F_Pos)                   /*!<TAMP2 tamper flag*/
#define  RTC_TAMPCR_TAMP2F                        RTC_TAMPCR_TAMP2F_Msk
#define  RTC_TAMPCR_TAMP1IF_Pos                   (9)
#define  RTC_TAMPCR_TAMP1IF_Msk                   (0x1U << RTC_TAMPCR_TAMP1IF_Pos)                  /*!<Tamper event 1 interrupt flag. The flag is set by hardware, and cleared by software.*/
#define  RTC_TAMPCR_TAMP1IF                       RTC_TAMPCR_TAMP1IF_Msk
#define  RTC_TAMPCR_TAMP2IF_Pos                   (10)
#define  RTC_TAMPCR_TAMP2IF_Msk                   (0x1U << RTC_TAMPCR_TAMP2IF_Pos)                  /*!<Tamper event 2 interrupt flag. The flag is set by hardware, and cleared by software.*/
#define  RTC_TAMPCR_TAMP2IF                       RTC_TAMPCR_TAMP2IF_Msk

/**
  * @brief RTC_BKPR Register Bit Definition
  */
#define  RTC_BKPR_BKP_Pos                         (0)
#define  RTC_BKPR_BKP_Msk                         (0xFFFFFFFFU << RTC_BKPR_BKP_Pos)                 /*!<When the device works in the low power mode, the content of these registers keeps active. In case of tamper detection event, the register will be reset. In case of TAMP1F=1 or TAMP2F=1, the register remains reset.*/
#define  RTC_BKPR_BKP                             RTC_BKPR_BKP_Msk
#define  RTC_BKPR_BKP_0                           (0x00000001U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_1                           (0x00000002U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_2                           (0x00000004U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_3                           (0x00000008U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_4                           (0x00000010U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_5                           (0x00000020U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_6                           (0x00000040U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_7                           (0x00000080U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_8                           (0x00000100U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_9                           (0x00000200U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_10                          (0x00000400U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_11                          (0x00000800U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_12                          (0x00001000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_13                          (0x00002000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_14                          (0x00004000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_15                          (0x00008000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_16                          (0x00010000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_17                          (0x00020000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_18                          (0x00040000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_19                          (0x00080000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_20                          (0x00100000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_21                          (0x00200000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_22                          (0x00400000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_23                          (0x00800000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_24                          (0x01000000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_25                          (0x02000000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_26                          (0x04000000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_27                          (0x08000000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_28                          (0x10000000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_29                          (0x20000000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_30                          (0x40000000U << RTC_BKPR_BKP_Pos) 
#define  RTC_BKPR_BKP_31                          (0x80000000U << RTC_BKPR_BKP_Pos) 

#endif

